Liste des statistiques à faire :  
*films : 
 *Type de films
 *durée
 *budget
*acteurs : 
 *nb de films
 *types de films

In [120]:
import pandas as pd

In [121]:
films = pd.read_csv('./donnees/films_selectionnes.csv', sep="\t", low_memory=False)

In [122]:
films_acteurs = pd.read_csv('./donnees_sources/films_selectionnes_avec_acteurs.csv', sep="\t", low_memory=False)

In [123]:
films_acteurs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104636 entries, 0 to 104635
Data columns (total 27 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   adult                 104636 non-null  bool
 1   budget                104636 non-null  int64
 2   genres                104636 non-null  object
 3   id_tmdb               104636 non-null  int64
 4   imdb_id               104636 non-null  object
 5   original_language     104636 non-null  object
 6   original_title        104636 non-null  object
 7   overview              104636 non-null  object
 8   popularity            104636 non-null  float64
 9   poster_path           104636 non-null  object
 10  production_countries  104636 non-null  object
 11  release_date          104636 non-null  object
 12  revenue               104636 non-null  int64
 13  runtime               104636 non-null  int64
 14  spoken_languages      104636 non-null  object
 15  status                104636 non-null  object
 16  title                 104636 non-null  object
 17  vote_average          104636 non-null  float64
 18  vote_count            104636 non-null  int64
 19  directors             104636 non-null  object
 20  writers               104636 non-null  object
 21  nconst                104636 non-null  object
 22  category              104636 non-null  object
 23  characters            104636 non-null  object
 24  primaryName           104636 non-null  object
 25  knownForTitles        104636 non-null  object
 26  year                  104636 non-null  int64
dtypes: bool(1), float64(2), int64(6), object(18)
memory usage: 20.9+ MB

In [124]:
films.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10474 entries, 0 to 10473
Data columns (total 43 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   adult                  10474 non-null  bool
 1   budget                 10474 non-null  int64
 2   genres                 10474 non-null  object
 3   id_tmdb                10474 non-null  int64
 4   imdb_id                10474 non-null  object
 5   original_language      10474 non-null  object
 6   original_title         10474 non-null  object
 7   overview               10474 non-null  object
 8   popularity             10474 non-null  float64
 9   poster_path            10474 non-null  object
 10  production_countries   10474 non-null  object
 11  release_date           10474 non-null  object
 12  revenue                10474 non-null  int64
 13  runtime                10474 non-null  int64
 14  spoken_languages       10474 non-null  object
 15  status                 10474 non-null  object
 16  title                  10474 non-null  object
 17  vote_average           10474 non-null  float64
 18  vote_count             10474 non-null  int64
 19  directors              10474 non-null  object
 20  writers                10474 non-null  object
 21  year                   10474 non-null  int64
 22  liste_acteurs_noms     10474 non-null  object
 23  liste_directeurs_noms  10474 non-null  object
 24  genre_liste            10474 non-null  object
 25  genre_Thriller         10474 non-null  bool
 26  genre_Mystery          10474 non-null  bool
 27  genre_Adventure        10474 non-null  bool
 28  genre_Crime            10474 non-null  bool
 29  genre_Romance          10474 non-null  bool
 30  genre_Family           10474 non-null  bool
 31  genre_Music            10474 non-null  bool
 32  genre_Animation        10474 non-null  bool
 33  genre_Documentary      10474 non-null  bool
 34  genre_War              10474 non-null  bool
 35  genre_Comedy           10474 non-null  bool
 36  genre_Fantasy          10474 non-null  bool
 37  genre_Horror           10474 non-null  bool
 38  genre_Western          10474 non-null  bool
 39  genre_History          10474 non-null  bool
 40  genre_Action           10474 non-null  bool
 41  genre_Science Fiction  10474 non-null  bool
 42  genre_Drama            10474 non-null  bool
dtypes: bool(19), float64(2), int64(6), object(16)
memory usage: 2.1+ MB

# Statistiques générales

On drop la colonne id_tmdb car cela n'a pas d'intérêt dans une table de statistiques

In [125]:
films_stat = films.drop('id_tmdb', axis =1).describe()
films_stat

,budget,popularity,revenue,runtime,vote_average,vote_count,year
count,1.047400e+04,10474.000000,1.047400e+04,10474.000000,10474.000000,10474.000000,10474.000000
mean,9.167602e+06,12.809045,2.411957e+07,107.205270,6.378683,562.329196,2012.996181
std,3.104580e+07,81.634501,1.178114e+08,22.681667,0.867769,2023.678618,6.388022
min,0.000000e+00,0.600000,0.000000e+00,60.000000,5.003000,0.000000,2000.000000
25%,0.000000e+00,1.960000,0.000000e+00,92.000000,5.759250,9.000000,2008.000000
50%,0.000000e+00,4.497500,0.000000e+00,102.000000,6.267500,37.000000,2014.000000
75%,6.300000e+05,9.846750,2.437875e+04,118.000000,6.867000,183.000000,2018.000000
max,5.793304e+08,4665.438000,2.923706e+09,345.000000,10.000000,33630.000000,2023.000000

On a décidé de ne pas faire de graph sur cette table mais on peut afficher le tableau
Describe donne un DataFrame donc on peut sélectionner une colonne

# Statistiques sur le Budget

evo du budget dans le temps : on calcule la moyenne par an (année de sortie) (on pourra faire min max... après)

on ne garde que les films dont le budget est supérieur à 0

In [126]:
films_avec_budget = films[films['budget'] > 0]
films_avec_budget

,adult,budget,genres,id_tmdb,imdb_id,original_language,original_title,overview,popularity,poster_path,...,genre_Documentary,genre_War,genre_Comedy,genre_Fantasy,genre_Horror,genre_Western,genre_History,genre_Action,genre_Science Fiction,genre_Drama
0,False,12800000,"['Drama', 'Crime']",16,tt0168629,en,Dancer in the Dark,"Selma, a Czech immigrant on the verge of blind...",13.781,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,False,False,True
1,False,140000000,"['Adventure', 'Fantasy', 'Action']",22,tt0325980,en,Pirates of the Caribbean: The Curse of the Bla...,"Jack Sparrow, a freewheeling 18th-century pira...",88.516,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,True,False,False,False,True,False,False
2,False,30000000,"['Action', 'Crime']",24,tt0266697,en,Kill Bill: Vol. 1,"An assassin is shot by her ruthless employer, ...",31.556,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,True,False,False
3,False,200000000,"['Adventure', 'Fantasy', 'Action']",58,tt0383574,en,Pirates of the Caribbean: Dead Man's Chest,Captain Jack Sparrow works his way out of a bl...,71.717,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,True,False,False,False,True,False,False
4,False,2000000,"['Thriller', 'Crime', 'Drama']",67,tt0445620,en,Paradise Now,Two childhood friends are recruited for a suic...,7.400,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,False,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10446,False,1288420,"['Action', 'Drama', 'Thriller']",150009,tt2560016,hi,Rajdhani Express,An eclectic group of passengers travelling fro...,0.883,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,True,False,True
10450,False,850000,"['Comedy', 'Romance']",173779,tt2106590,fr,Ouf,"François has everything he could ever want, un...",1.050,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,True,False,False,False,False,False,False,False
10455,False,12000000,['Comedy'],182219,tt2276778,fr,Les Profs,With only 12 percent of its pupils obtaining t...,0.600,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,True,False,False,False,False,False,False,False
10457,False,6900000,"['Action', 'Crime', 'Drama', 'History']",188640,tt2301155,hi,शूटआऊट ऍट वडाला,The first-ever registered encounter by the Mum...,0.600,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,True,True,False,True
10462,False,30000000,"['War', 'Action', 'Drama']",203793,tt1966566,ru,Сталинград,A band of determined Russian soldiers fight to...,0.600,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,True,False,False,False,False,False,True,False,True

On affiche les statistiques du champ budget

In [127]:
films_avec_budget['budget'].describe()

count    2.835000e+03
mean     3.387001e+07
std      5.220053e+07
min      1.000000e+00
25%      4.000000e+06
50%      1.200000e+07
75%      4.000000e+07
max      5.793304e+08
Name: budget, dtype: float64

On calcule le budget moyen par an

In [128]:
budget_moyen_an = films_avec_budget['budget'].groupby(films_avec_budget['year']).mean()
budget_moyen_an

year
2000    3.362226e+07
2001    3.865007e+07
2002    3.480317e+07
2003    3.805469e+07
2004    3.685713e+07
2005    3.659154e+07
2006    3.313919e+07
2007    2.992344e+07
2008    3.394310e+07
2009    2.843755e+07
2010    2.908861e+07
2011    2.973858e+07
2012    3.315063e+07
2013    3.483147e+07
2014    3.754343e+07
2015    3.326329e+07
2016    3.354250e+07
2017    3.418924e+07
2018    3.697263e+07
2019    3.581981e+07
2020    3.072006e+07
2021    3.838418e+07
2022    3.690227e+07
2023    2.454423e+07
Name: budget, dtype: float64

On fait pareil pour le minimum

In [129]:
budget_min_an = films_avec_budget['budget'].groupby(films_avec_budget['year']).min()
budget_min_an

year
2000     46000
2001        50
2002         2
2003         8
2004     74050
2005    500000
2006        24
2007        16
2008         1
2009        10
2010       200
2011         1
2012         5
2013         7
2014         1
2015         9
2016        60
2017       150
2018         1
2019        20
2020         2
2021     10000
2022       300
2023      5000
Name: budget, dtype: int64

on fait pareil pour max

In [130]:
budget_max_an = films_avec_budget['budget'].groupby(films_avec_budget['year']).max()
budget_max_an

year
2000    125000000
2001    140000000
2002    140000000
2003    200000000
2004    200000000
2005    207000000
2006    270000000
2007    300000000
2008    200000000
2009    237000000
2010    200000000
2011    379000000
2012    250000000
2013    250000000
2014    250000000
2015    365000000
2016    250000000
2017    300000000
2018    579330426
2019    356000000
2020    205000000
2021    250000000
2022    460000000
2023    250000000
Name: budget, dtype: int64

In [131]:
budget = pd.merge(budget_max_an, budget_min_an,how='left',on='year')
budget = pd.merge(budget, budget_moyen_an,on='year')
budget = budget.rename(columns={'budget_x':'budget_max','budget_y':'budget_min','budget':'budget_moyen'})
budget = budget.reset_index(drop=False)
budget

    year  budget_max  budget_min  budget_moyen
0   2000   125000000       46000  3.362226e+07
1   2001   140000000          50  3.865007e+07
2   2002   140000000           2  3.480317e+07
3   2003   200000000           8  3.805469e+07
4   2004   200000000       74050  3.685713e+07
5   2005   207000000      500000  3.659154e+07
6   2006   270000000          24  3.313919e+07
7   2007   300000000          16  2.992344e+07
8   2008   200000000           1  3.394310e+07
9   2009   237000000          10  2.843755e+07
10  2010   200000000         200  2.908861e+07
11  2011   379000000           1  2.973858e+07
12  2012   250000000           5  3.315063e+07
13  2013   250000000           7  3.483147e+07
14  2014   250000000           1  3.754343e+07
15  2015   365000000           9  3.326329e+07
16  2016   250000000          60  3.354250e+07
17  2017   300000000         150  3.418924e+07
18  2018   579330426           1  3.697263e+07
19  2019   356000000          20  3.581981e+07
20  2020   205000000           2  3.072006e+07
21  2021   250000000       10000  3.838418e+07
22  2022   460000000         300  3.690227e+07
23  2023   250000000        5000  2.454423e+07

On exporte le DataFrame Budget

In [132]:
budget.to_csv("./donnees/stat/budget.csv",index=False)

# statistique sur original language

# On compte le nombre de films par langue

In [133]:
original_language_nb_films = films['id_tmdb'].groupby(films['original_language']).count()
original_language_nb_films

original_language
af      3
am      2
ar    114
as      1
az      2
     ...
vi     17
xh      1
xx      2
yi      1
zh    331
Name: id_tmdb, Length: 88, dtype: int64

graphique envisagé langue d'origine
diagramme en barre / histogramme x = langue y = count
comme beaucoup de langue on prend celle qui ont plus de 50 films

# Statistiques sur les revenus

On en garde que les films avec un revenu

In [134]:
films_avec_revenue = films[films['revenue'] > 0]
films_avec_revenue

,adult,budget,genres,id_tmdb,imdb_id,original_language,original_title,overview,popularity,poster_path,...,genre_Documentary,genre_War,genre_Comedy,genre_Fantasy,genre_Horror,genre_Western,genre_History,genre_Action,genre_Science Fiction,genre_Drama
0,False,12800000,"['Drama', 'Crime']",16,tt0168629,en,Dancer in the Dark,"Selma, a Czech immigrant on the verge of blind...",13.781,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,False,False,True
1,False,140000000,"['Adventure', 'Fantasy', 'Action']",22,tt0325980,en,Pirates of the Caribbean: The Curse of the Bla...,"Jack Sparrow, a freewheeling 18th-century pira...",88.516,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,True,False,False,False,True,False,False
2,False,30000000,"['Action', 'Crime']",24,tt0266697,en,Kill Bill: Vol. 1,"An assassin is shot by her ruthless employer, ...",31.556,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,True,False,False
3,False,200000000,"['Adventure', 'Fantasy', 'Action']",58,tt0383574,en,Pirates of the Caribbean: Dead Man's Chest,Captain Jack Sparrow works his way out of a bl...,71.717,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,True,False,False,False,True,False,False
4,False,2000000,"['Thriller', 'Crime', 'Drama']",67,tt0445620,en,Paradise Now,Two childhood friends are recruited for a suic...,7.400,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,False,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10362,False,60000000,"['Action', 'Thriller']",343611,tt3393786,en,Jack Reacher: Never Go Back,When Major Susan Turner is arrested for treaso...,71.458,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,True,False,False
10363,False,104000000,"['Action', 'Adventure', 'Comedy']",343668,tt4649466,en,Kingsman: The Golden Circle,When an attack on the Kingsman headquarters ta...,69.810,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,True,False,False,False,False,True,False,False
10421,False,3512454,['Drama'],110428,tt2018086,fr,"Camille Claudel, 1915","Winter, 1915. Confined by her family to an asy...",0.600,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,False,False,True
10457,False,6900000,"['Action', 'Crime', 'Drama', 'History']",188640,tt2301155,hi,शूटआऊट ऍट वडाला,The first-ever registered encounter by the Mum...,0.600,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,True,True,False,True
10462,False,30000000,"['War', 'Action', 'Drama']",203793,tt1966566,ru,Сталинград,A band of determined Russian soldiers fight to...,0.600,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,True,False,False,False,False,False,True,False,True

On calcule la moyenne par an

In [135]:
revenue_moyen_an = films_avec_revenue['revenue'].groupby(films_avec_revenue['year']).mean()
revenue_moyen_an

year
2000    7.756277e+07
2001    8.316435e+07
2002    7.923036e+07
2003    9.964659e+07
2004    8.034508e+07
2005    7.225733e+07
2006    7.772447e+07
2007    7.881006e+07
2008    9.646251e+07
2009    9.036840e+07
2010    6.715900e+07
2011    8.966112e+07
2012    7.974852e+07
2013    9.022888e+07
2014    1.138388e+08
2015    1.150209e+08
2016    8.763587e+07
2017    1.196486e+08
2018    1.274811e+08
2019    9.925663e+07
2020    4.334437e+07
2021    8.235871e+07
2022    1.375949e+08
2023    1.314529e+08
Name: revenue, dtype: float64

On calcule le minimum par an

In [136]:
revenue_min_an = films_avec_revenue['revenue'].groupby(films_avec_revenue['year']).min()
revenue_min_an

year
2000        28
2001        60
2002       921
2003      8500
2004        21
2005        27
2006         2
2007         6
2008        10
2009        10
2010       200
2011     11229
2012         5
2013        12
2014         1
2015      5000
2016       109
2017         9
2018        24
2019      1000
2020     46855
2021        10
2022      1000
2023    159959
Name: revenue, dtype: int64

On calcule le max par an

In [137]:
revenue_max_an = films_avec_revenue['revenue'].groupby(films_avec_revenue['year']).max()
revenue_max_an

year
2000     546388105
2001     871368364
2002     926287400
2003    1118888979
2004     783766341
2005     850000000
2006    1065659812
2007     961000000
2008    1004558444
2009    2923706026
2010     825532764
2011    1123794079
2012    1518815515
2013    1215577205
2014    1104054072
2015    2068223624
2016    1153337496
2017    1332698830
2018    2046239637
2019    2794731755
2020     503063688
2021    1921847111
2022    2319331580
2023     604380922
Name: revenue, dtype: int64

In [138]:
revenue = pd.merge(revenue_max_an, revenue_min_an,how='left',on='year')
revenue = pd.merge(revenue, revenue_moyen_an,on='year')
revenue = revenue.rename(columns={'revenue_x':'revenue_max','revenue_y':'revenue_min','revenue':'revenue_moyen'})
revenue = revenue.reset_index(drop=False)
revenue

    year  revenue_max  revenue_min  revenue_moyen
0   2000    546388105           28   7.756277e+07
1   2001    871368364           60   8.316435e+07
2   2002    926287400          921   7.923036e+07
3   2003   1118888979         8500   9.964659e+07
4   2004    783766341           21   8.034508e+07
5   2005    850000000           27   7.225733e+07
6   2006   1065659812            2   7.772447e+07
7   2007    961000000            6   7.881006e+07
8   2008   1004558444           10   9.646251e+07
9   2009   2923706026           10   9.036840e+07
10  2010    825532764          200   6.715900e+07
11  2011   1123794079        11229   8.966112e+07
12  2012   1518815515            5   7.974852e+07
13  2013   1215577205           12   9.022888e+07
14  2014   1104054072            1   1.138388e+08
15  2015   2068223624         5000   1.150209e+08
16  2016   1153337496          109   8.763587e+07
17  2017   1332698830            9   1.196486e+08
18  2018   2046239637           24   1.274811e+08
19  2019   2794731755         1000   9.925663e+07
20  2020    503063688        46855   4.334437e+07
21  2021   1921847111           10   8.235871e+07
22  2022   2319331580         1000   1.375949e+08
23  2023    604380922       159959   1.314529e+08

In [139]:
revenue.to_csv("./donnees/stat/revenue.csv",index=False)

## Statistiques sur le profit  
profit = revenue - budget

In [140]:
len(films_avec_revenue)

2719

In [141]:
len(films_avec_budget)

2835

on prend les films avec budget et on filtre pour ne garder qe ceux qui ont un revenu

In [142]:
films_avec_revenue_et_budget = films_avec_budget[films_avec_budget['revenue']>0]
films_avec_revenue_et_budget

,adult,budget,genres,id_tmdb,imdb_id,original_language,original_title,overview,popularity,poster_path,...,genre_Documentary,genre_War,genre_Comedy,genre_Fantasy,genre_Horror,genre_Western,genre_History,genre_Action,genre_Science Fiction,genre_Drama
0,False,12800000,"['Drama', 'Crime']",16,tt0168629,en,Dancer in the Dark,"Selma, a Czech immigrant on the verge of blind...",13.781,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,False,False,True
1,False,140000000,"['Adventure', 'Fantasy', 'Action']",22,tt0325980,en,Pirates of the Caribbean: The Curse of the Bla...,"Jack Sparrow, a freewheeling 18th-century pira...",88.516,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,True,False,False,False,True,False,False
2,False,30000000,"['Action', 'Crime']",24,tt0266697,en,Kill Bill: Vol. 1,"An assassin is shot by her ruthless employer, ...",31.556,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,True,False,False
3,False,200000000,"['Adventure', 'Fantasy', 'Action']",58,tt0383574,en,Pirates of the Caribbean: Dead Man's Chest,Captain Jack Sparrow works his way out of a bl...,71.717,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,True,False,False,False,True,False,False
4,False,2000000,"['Thriller', 'Crime', 'Drama']",67,tt0445620,en,Paradise Now,Two childhood friends are recruited for a suic...,7.400,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,False,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10362,False,60000000,"['Action', 'Thriller']",343611,tt3393786,en,Jack Reacher: Never Go Back,When Major Susan Turner is arrested for treaso...,71.458,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,True,False,False
10363,False,104000000,"['Action', 'Adventure', 'Comedy']",343668,tt4649466,en,Kingsman: The Golden Circle,When an attack on the Kingsman headquarters ta...,69.810,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,True,False,False,False,False,True,False,False
10421,False,3512454,['Drama'],110428,tt2018086,fr,"Camille Claudel, 1915","Winter, 1915. Confined by her family to an asy...",0.600,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,False,False,True
10457,False,6900000,"['Action', 'Crime', 'Drama', 'History']",188640,tt2301155,hi,शूटआऊट ऍट वडाला,The first-ever registered encounter by the Mum...,0.600,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,True,True,False,True
10462,False,30000000,"['War', 'Action', 'Drama']",203793,tt1966566,ru,Сталинград,A band of determined Russian soldiers fight to...,0.600,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,True,False,False,False,False,False,True,False,True

On crée la colonne profit

In [143]:
films_avec_revenue_et_budget['profit'] = films_avec_revenue_et_budget['revenue'] - films_avec_revenue_et_budget['budget']
films_avec_revenue_et_budget

C:\Users\LOTUS\AppData\Local\Temp\ipykernel_18472\4256382545.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  films_avec_revenue_et_budget['profit'] = films_avec_revenue_et_budget['revenue'] - films_avec_revenue_et_budget['budget']

,adult,budget,genres,id_tmdb,imdb_id,original_language,original_title,overview,popularity,poster_path,...,genre_War,genre_Comedy,genre_Fantasy,genre_Horror,genre_Western,genre_History,genre_Action,genre_Science Fiction,genre_Drama,profit
0,False,12800000,"['Drama', 'Crime']",16,tt0168629,en,Dancer in the Dark,"Selma, a Czech immigrant on the verge of blind...",13.781,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,False,True,27231879
1,False,140000000,"['Adventure', 'Fantasy', 'Action']",22,tt0325980,en,Pirates of the Caribbean: The Curse of the Bla...,"Jack Sparrow, a freewheeling 18th-century pira...",88.516,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,True,False,False,False,True,False,False,515011224
2,False,30000000,"['Action', 'Crime']",24,tt0266697,en,Kill Bill: Vol. 1,"An assassin is shot by her ruthless employer, ...",31.556,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,True,False,False,150906076
3,False,200000000,"['Adventure', 'Fantasy', 'Action']",58,tt0383574,en,Pirates of the Caribbean: Dead Man's Chest,Captain Jack Sparrow works his way out of a bl...,71.717,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,True,False,False,False,True,False,False,865659812
4,False,2000000,"['Thriller', 'Crime', 'Drama']",67,tt0445620,en,Paradise Now,Two childhood friends are recruited for a suic...,7.400,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,False,True,1395627
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10362,False,60000000,"['Action', 'Thriller']",343611,tt3393786,en,Jack Reacher: Never Go Back,When Major Susan Turner is arrested for treaso...,71.458,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,True,False,False,102146076
10363,False,104000000,"['Action', 'Adventure', 'Comedy']",343668,tt4649466,en,Kingsman: The Golden Circle,When an attack on the Kingsman headquarters ta...,69.810,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,True,False,False,False,False,True,False,False,306902662
10421,False,3512454,['Drama'],110428,tt2018086,fr,"Camille Claudel, 1915","Winter, 1915. Confined by her family to an asy...",0.600,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,False,True,-3396594
10457,False,6900000,"['Action', 'Crime', 'Drama', 'History']",188640,tt2301155,hi,शूटआऊट ऍट वडाला,The first-ever registered encounter by the Mum...,0.600,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,True,True,False,True,4100000
10462,False,30000000,"['War', 'Action', 'Drama']",203793,tt1966566,ru,Сталинград,A band of determined Russian soldiers fight to...,0.600,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,True,False,False,False,False,False,True,False,True,38129518

In [144]:
profit_moy_an = films_avec_revenue_et_budget['profit'].groupby(films_avec_revenue_et_budget['year']).mean()
profit_moy_an

year
2000    5.266275e+07
2001    5.079314e+07
2002    6.847077e+07
2003    8.118918e+07
2004    5.668909e+07
2005    4.632403e+07
2006    5.122021e+07
2007    6.261482e+07
2008    8.273941e+07
2009    7.575278e+07
2010    4.772475e+07
2011    6.460042e+07
2012    6.986431e+07
2013    7.459862e+07
2014    1.139739e+08
2015    1.173018e+08
2016    7.301651e+07
2017    1.213897e+08
2018    1.392400e+08
2019    1.107032e+08
2020    3.609576e+07
2021    5.565722e+07
2022    1.557529e+08
2023    1.051777e+08
Name: profit, dtype: float64

In [145]:
profit_min_an = films_avec_revenue_et_budget['profit'].groupby(films_avec_revenue_et_budget['year']).min()
profit_min_an

year
2000    -46536031
2001    -61403089
2002    -48367617
2003    -36064237
2004    -37821105
2005    -69833498
2006    -63093812
2007    -41696962
2008    -31361837
2009    -44668279
2010    -72822007
2011    -34554000
2012    -37812187
2013    -68351500
2014    -31657368
2015    -52247060
2016    -60506085
2017    -63587851
2018    -27864000
2019    -26859030
2020   -133200000
2021   -185600000
2022    -78704637
2023    -43000000
Name: profit, dtype: int64

In [146]:
profit_max_an = films_avec_revenue_et_budget['profit'].groupby(films_avec_revenue_et_budget['year']).max()
profit_max_an

year
2000     421388105
2001     778368364
2002     847287400
2003    1024888979
2004     583766341
2005     737000000
2006     865659812
2007     661000000
2008     819558444
2009    2686706026
2010     665532764
2011     928794079
2012    1298815515
2013    1015577205
2014     894054072
2015    1823223624
2016     903337496
2017    1132698830
2018    1746239637
2019    2438731755
2020     487263688
2021    1721847111
2022    1859331580
2023     530579095
Name: profit, dtype: int64

In [147]:
profit = pd.merge(profit_max_an, profit_min_an,how='left',on='year')
profit = pd.merge(profit, profit_moy_an,on='year')
profit = profit.rename(columns={'profit_x':'profit_max','profit_y':'profit_min','profit':'profit_moyen'})
profit = profit.reset_index(drop=False)
profit

    year  profit_max  profit_min  profit_moyen
0   2000   421388105   -46536031  5.266275e+07
1   2001   778368364   -61403089  5.079314e+07
2   2002   847287400   -48367617  6.847077e+07
3   2003  1024888979   -36064237  8.118918e+07
4   2004   583766341   -37821105  5.668909e+07
5   2005   737000000   -69833498  4.632403e+07
6   2006   865659812   -63093812  5.122021e+07
7   2007   661000000   -41696962  6.261482e+07
8   2008   819558444   -31361837  8.273941e+07
9   2009  2686706026   -44668279  7.575278e+07
10  2010   665532764   -72822007  4.772475e+07
11  2011   928794079   -34554000  6.460042e+07
12  2012  1298815515   -37812187  6.986431e+07
13  2013  1015577205   -68351500  7.459862e+07
14  2014   894054072   -31657368  1.139739e+08
15  2015  1823223624   -52247060  1.173018e+08
16  2016   903337496   -60506085  7.301651e+07
17  2017  1132698830   -63587851  1.213897e+08
18  2018  1746239637   -27864000  1.392400e+08
19  2019  2438731755   -26859030  1.107032e+08
20  2020   487263688  -133200000  3.609576e+07
21  2021  1721847111  -185600000  5.565722e+07
22  2022  1859331580   -78704637  1.557529e+08
23  2023   530579095   -43000000  1.051777e+08

In [148]:
profit.to_csv("./donnees/stat/profit.csv",index=False)

# Statistiques sur les langues parlées dans les films

Les langues parlées sont une liste

In [149]:
films['spoken_languages']

0                          ['en']
1                          ['en']
2              ['en', 'ja', 'fr']
3        ['en', 'tr', 'el', 'zh']
4                    ['ar', 'en']
                   ...
10469    ['fr', 'wo', 'it', 'en']
10470                      ['ar']
10471                      ['es']
10472                          []
10473                      ['es']
Name: spoken_languages, Length: 10474, dtype: object

On crée un DataFrame qui contient que le nombre de films pour chaque langue. 
la liste originale n'est pas détectée comme une liste donc on la transforme en une liste puis on la parcourt pour créer le dataFrame

In [150]:
df_langue = pd.DataFrame(columns=['language','nombre'])


for i in films['spoken_languages'].items():
    # print(i)
    # print(i[1])
    # print(type(i[1]))
    string_langue = i[1]
    string_langue = string_langue.replace("['","")
    string_langue = string_langue.replace("']","")
    string_langue = string_langue.replace("'","")
    liste_langue = string_langue.split(", ")
    # print(liste_langue)
    # print(len(liste_langue))
    for langue in liste_langue:
        if langue not in df_langue['language'].values:
            # Ajouter une nouvelle ligne
            new_row = pd.DataFrame({'language': [langue], 'nombre': [1]})
            df_langue = pd.concat([df_langue, new_row], ignore_index=True)
        else:
            # Incrémenter le compteur
            idx = df_langue[df_langue['language'] == langue].index
            df_langue.loc[idx, 'nombre'] += 1
df_langue

    language nombre
0         en   3990
1         ja    871
2         fr   3188
3         tr    110
4         el     67
..       ...    ...
126       oc      1
127       st      1
128       dz      1
129       an      1
130       ab      1

[131 rows x 2 columns]

# Statistiques sur les directeurs

Nombre de films par directeurs et évolution

Il peut y avoir plusieurs directeurs (liste). On la parcourt pour créer un dataframe avec le nombre de films pour chaque directeur

La liste contient les codes des personnes donc après avoir fait le tableau on va chercher les noms correspondant au code dans la table name basics

In [151]:
df_directeur_sans_nom = pd.DataFrame(columns=['director','nombre'])


for i in films['directors'].items():
    # print(i[1])
    # print(i[1])
    # print(type(i[1]))
    # string_directeur = i[1]
    # string_directeur = string_directeur.replace("['","")
    # string_directeur = string_directeur.replace("']","")
    # string_directeur = string_directeur.replace("'","")
    liste_directeur = i[1].split(",")
    # print(liste_directeur)
    # print(len(liste_directeur))
    for directeur in liste_directeur:
        if directeur not in df_directeur_sans_nom['director'].values:
            # Ajouter une nouvelle ligne
            new_row = pd.DataFrame({'director': [directeur], 'nombre': [1]})
            df_directeur_sans_nom = pd.concat([df_directeur_sans_nom, new_row], ignore_index=True)
        else:
            # Incrémenter le compteur
            idx = df_directeur_sans_nom[df_directeur_sans_nom['director'] == directeur].index
            df_directeur_sans_nom.loc[idx, 'nombre'] += 1
df_directeur_sans_nom

       director nombre
0     nm0001885     11
1     nm0893659      5
2     nm0000233      7
3     nm0009463      1
4     nm0197636      1
...         ...    ...
7293  nm1441432      1
7294  nm0067946      1
7295  nm1318393      1
7296  nm2065393      1
7297  nm1870338      1

[7298 rows x 2 columns]

In [152]:
name_basics = pd.read_csv("./donnees_sources/IMDb/name.basics.tsv/name.basics.tsv", sep="\t", low_memory=False)

In [153]:
df_directeur_avec_nom = pd.merge(df_directeur_sans_nom, 
                                 name_basics,
                                 how = 'left',
                                 left_on = 'director',
                                 right_on = 'nconst'
                            )
df_directeur_avec_nom.head()

,director,nombre,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0001885,11,nm0001885,Lars von Trier,1956,\N,"writer,director,producer","tt0168629,tt4003440,tt1527186,tt0870984"
1,nm0893659,5,nm0893659,Gore Verbinski,1964,\N,"director,producer,writer","tt1192628,tt0325980,tt4731136,tt1210819"
2,nm0000233,7,nm0000233,Quentin Tarantino,1963,\N,"producer,writer,actor","tt0105236,tt0110912,tt0116367,tt7131622"
3,nm0009463,1,nm0009463,Hany Abu-Assad,1961,\N,"director,writer,producer","tt2852406,tt0445620,tt0305229,tt4686692"
4,nm0197636,1,nm0197636,Stephen Daldry,1960,\N,"producer,director,miscellaneous","tt0976051,tt0274558,tt0249462,tt0477302"

On supprime les colonnes qui ne nous interessent pas

In [154]:
df_directeur_avec_nom = df_directeur_avec_nom.drop(['nconst','birthYear','deathYear','primaryProfession','knownForTitles'], axis=1)

On exporte cette table

In [155]:
df_directeur_avec_nom.to_csv('./donnees/stat/directeur_avec_nb_films.csv', sep="\t", index=False)

## Création d'un DataFrame avec pour chaque directeur la liste de ses films

In [156]:
films_directeurs = films.copy()
films_directeurs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10474 entries, 0 to 10473
Data columns (total 43 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   adult                  10474 non-null  bool
 1   budget                 10474 non-null  int64
 2   genres                 10474 non-null  object
 3   id_tmdb                10474 non-null  int64
 4   imdb_id                10474 non-null  object
 5   original_language      10474 non-null  object
 6   original_title         10474 non-null  object
 7   overview               10474 non-null  object
 8   popularity             10474 non-null  float64
 9   poster_path            10474 non-null  object
 10  production_countries   10474 non-null  object
 11  release_date           10474 non-null  object
 12  revenue                10474 non-null  int64
 13  runtime                10474 non-null  int64
 14  spoken_languages       10474 non-null  object
 15  status                 10474 non-null  object
 16  title                  10474 non-null  object
 17  vote_average           10474 non-null  float64
 18  vote_count             10474 non-null  int64
 19  directors              10474 non-null  object
 20  writers                10474 non-null  object
 21  year                   10474 non-null  int64
 22  liste_acteurs_noms     10474 non-null  object
 23  liste_directeurs_noms  10474 non-null  object
 24  genre_liste            10474 non-null  object
 25  genre_Thriller         10474 non-null  bool
 26  genre_Mystery          10474 non-null  bool
 27  genre_Adventure        10474 non-null  bool
 28  genre_Crime            10474 non-null  bool
 29  genre_Romance          10474 non-null  bool
 30  genre_Family           10474 non-null  bool
 31  genre_Music            10474 non-null  bool
 32  genre_Animation        10474 non-null  bool
 33  genre_Documentary      10474 non-null  bool
 34  genre_War              10474 non-null  bool
 35  genre_Comedy           10474 non-null  bool
 36  genre_Fantasy          10474 non-null  bool
 37  genre_Horror           10474 non-null  bool
 38  genre_Western          10474 non-null  bool
 39  genre_History          10474 non-null  bool
 40  genre_Action           10474 non-null  bool
 41  genre_Science Fiction  10474 non-null  bool
 42  genre_Drama            10474 non-null  bool
dtypes: bool(19), float64(2), int64(6), object(16)
memory usage: 2.1+ MB

In [157]:
films_directeurs['liste_directors'] = films['directors'].str.split(',')

In [158]:
films_directors_explode = films_directeurs.explode('liste_directors')
films_directors_explode

,adult,budget,genres,id_tmdb,imdb_id,original_language,original_title,overview,popularity,poster_path,...,genre_War,genre_Comedy,genre_Fantasy,genre_Horror,genre_Western,genre_History,genre_Action,genre_Science Fiction,genre_Drama,liste_directors
0,False,12800000,"['Drama', 'Crime']",16,tt0168629,en,Dancer in the Dark,"Selma, a Czech immigrant on the verge of blind...",13.781,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,False,True,nm0001885
1,False,140000000,"['Adventure', 'Fantasy', 'Action']",22,tt0325980,en,Pirates of the Caribbean: The Curse of the Bla...,"Jack Sparrow, a freewheeling 18th-century pira...",88.516,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,True,False,False,False,True,False,False,nm0893659
2,False,30000000,"['Action', 'Crime']",24,tt0266697,en,Kill Bill: Vol. 1,"An assassin is shot by her ruthless employer, ...",31.556,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,True,False,False,nm0000233
3,False,200000000,"['Adventure', 'Fantasy', 'Action']",58,tt0383574,en,Pirates of the Caribbean: Dead Man's Chest,Captain Jack Sparrow works his way out of a bl...,71.717,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,True,False,False,False,True,False,False,nm0893659
4,False,2000000,"['Thriller', 'Crime', 'Drama']",67,tt0445620,en,Paradise Now,Two childhood friends are recruited for a suic...,7.400,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,False,True,nm0009463
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10469,False,0,['Drama'],214142,tt3035858,fr,Des étoiles,The debut feature from Franco-Senegalese filmm...,0.994,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,False,True,nm1441432
10470,False,0,['Drama'],215034,tt3118628,en,Bastardo,Larger-than-life characters populate director ...,1.378,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,False,True,nm0067946
10471,False,0,['Drama'],219173,tt1576452,es,Por tu culpa,"Are we what others see, or are we what we allo...",0.743,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,False,False,True,nm1318393
10472,False,0,['Action'],222409,tt1512732,en,Braille,Nick's blindness is symbolic to his regret for...,0.824,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,False,False,False,True,False,False,nm2065393
10473,False,0,"['Thriller', 'Horror', 'Action', 'Adventure', ...",231003,tt2011045,en,Hombre Y Tierra,"Mauro Bosque was an adventurer, a survivalist,...",0.840,https://image.tmdb.org/t/p/w600_and_h900_bestv...,...,False,False,False,True,False,False,True,False,True,nm1870338

In [159]:
df_directeur_liste_films = films_directors_explode.groupby('liste_directors')['id_tmdb'].apply(list).reset_index().rename(
                                                    columns={'liste_directors': 'directeur', 'id_tmdb': 'liste_films'})
df_directeur_liste_films

      directeur                                        liste_films
0            \N  [801293, 689726, 535076, 494698, 481760, 46724...
1     nm0000080                                           [299782]
2     nm0000091                                     [10798, 12577]
3     nm0000095            [116, 4787, 5038, 10739, 19265, 229297]
4     nm0000108  [9992, 11227, 484641, 26505, 35552, 42949, 778...
...         ...                                                ...
7293  nm9955258                                           [220495]
7294  nm9955408                                           [535369]
7295  nm9957570                                           [582897]
7296  nm9967772                                            [20294]
7297  nm9970487                                           [734438]

[7298 rows x 2 columns]

In [160]:
df_directeur_liste_films = pd.merge(df_directeur_liste_films,
                                    name_basics,
                                    how ='left',
                                    left_on = 'directeur',
                                    right_on = 'nconst')

In [161]:
df_directeur_liste_films = df_directeur_liste_films.drop(['primaryProfession','knownForTitles','nconst','birthYear','deathYear'], axis=1)

In [162]:
df_directeur_liste_films = df_directeur_liste_films.rename(columns={'directeur':'id_directeur', 'primaryName':'directeur'})
df_directeur_liste_films

,id_directeur,liste_films,directeur
0,\N,"[801293, 689726, 535076, 494698, 481760, 46724...",NaN
1,nm0000080,[299782],Orson Welles
2,nm0000091,"[10798, 12577]",Gérard Pirès
3,nm0000095,"[116, 4787, 5038, 10739, 19265, 229297]",Woody Allen
4,nm0000108,"[9992, 11227, 484641, 26505, 35552, 42949, 778...",Luc Besson
...,...,...,...
7293,nm9955258,[220495],Ajit Sable
7294,nm9955408,[535369],Ajay Bhupathi
7295,nm9957570,[582897],Manele Labidi
7296,nm9967772,[20294],Mayur K. Barot
7297,nm9970487,[734438],Adrien Piquet-Gauthier

On enlève la ligne 0 qui contient les films sans directeur

In [163]:
df_directeur_liste_films = df_directeur_liste_films.drop(0)

In [45]:
df_directeur_liste_films.to_csv('./donnees/stat/df_directeur_liste_films.csv', sep="\t")

# Statistiques sur les scenaristes

nombre de films par scenariste

Il peut y avoir plusieurs scenaristes (liste). On la parcourt pour créer un dataframe avec le nombre de films pour chaque scenariste

La liste contient les codes des personnes donc après avoir fait le tableau on va chercher les noms correspondant au code dans la table name basics

In [165]:
df_ecrivain_sans_nom = pd.DataFrame(columns=['ecrivain','nombre'])


for i in films['writers'].items():
    # print(i[1])
    # print(i[1])
    # print(type(i[1]))
    liste_ecrivain = i[1].split(",")
    # print(liste_ecrivain)
    # print(len(liste_ecrivain))
    for ecrivain in liste_ecrivain:
        if ecrivain not in df_ecrivain_sans_nom['ecrivain'].values:
            # Ajouter une nouvelle ligne
            new_row = pd.DataFrame({'ecrivain': [ecrivain], 'nombre': [1]})
            df_ecrivain_sans_nom = pd.concat([df_ecrivain_sans_nom, new_row], ignore_index=True)
        else:
            # Incrémenter le compteur
            idx = df_ecrivain_sans_nom[df_ecrivain_sans_nom['ecrivain'] == ecrivain].index
            df_ecrivain_sans_nom.loc[idx, 'nombre'] += 1
df_ecrivain_sans_nom

        ecrivain nombre
0      nm0001885     11
1      nm0797604      2
2      nm0254645      8
3      nm0744429     10
4      nm0064181      9
...          ...    ...
14331  nm1196938      1
14332  nm2065393      1
14333  nm1863128      1
14334  nm1870338      1
14335  nm2566773      1

[14336 rows x 2 columns]

In [166]:
df_ecrivain_avec_nom = pd.merge(df_ecrivain_sans_nom, 
                                 name_basics,
                                 how = 'left',
                                 left_on = 'ecrivain',
                                 right_on = 'nconst'
                            )
df_ecrivain_avec_nom.head()

,ecrivain,nombre,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0001885,11,nm0001885,Lars von Trier,1956,\N,"writer,director,producer","tt0168629,tt4003440,tt1527186,tt0870984"
1,nm0797604,2,nm0797604,Sjón,1962,\N,"writer,script_department,actor","tt11138512,tt9812474,tt0168629,tt0461958"
2,nm0254645,8,nm0254645,Ted Elliott,1961,\N,"writer,producer,miscellaneous","tt0126029,tt1210819,tt0325980,tt0103639"
3,nm0744429,10,nm0744429,Terry Rossio,\N,\N,"writer,producer,director","tt0103639,tt0325980,tt0126029,tt0453467"
4,nm0064181,9,nm0064181,Stuart Beattie,\N,\N,"writer,producer,director","tt14174940,tt0369339,tt0325980,tt0441881"

In [167]:
df_ecrivain_avec_nom = df_ecrivain_avec_nom.drop(['nconst','birthYear','deathYear','primaryProfession','knownForTitles'], axis=1)
df_ecrivain_avec_nom

        ecrivain nombre         primaryName
0      nm0001885     11      Lars von Trier
1      nm0797604      2                Sjón
2      nm0254645      8         Ted Elliott
3      nm0744429     10        Terry Rossio
4      nm0064181      9      Stuart Beattie
...          ...    ...                 ...
14331  nm1196938      1         Sergio Wolf
14332  nm2065393      1      Matthew Chuang
14333  nm1863128      1          Joe Capelo
14334  nm1870338      1  Christian Cisneros
14335  nm2566773      1   Richard L. Watson

[14336 rows x 3 columns]

# Statistiques sur les acteurs :
nb de films par acteurs et genre par acteurs

On crée un DataFrame avec le nombre de films pour chaque acteur et un autre avec le nombre de films par genre et par acteur

## Nombre de films par acteur

In [168]:
films_acteurs.columns

Index(['adult', 'budget', 'genres', 'id_tmdb', 'imdb_id', 'original_language',
       'original_title', 'overview', 'popularity', 'poster_path',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'title', 'vote_average', 'vote_count',
       'directors', 'writers', 'nconst', 'category', 'characters',
       'primaryName', 'knownForTitles', 'year'],
      dtype='object')

In [169]:
films_acteurs_sans_doublons = films_acteurs[['primaryName','id_tmdb']].drop_duplicates()
films_acteurs_sans_doublons

                primaryName  id_tmdb
0                     Björk       16
1         Catherine Deneuve       16
2               David Morse       16
3            Peter Stormare       16
4                 Joel Grey       16
...                     ...      ...
104631      Nicholas Baldas   222409
104632  Stephanie Bendixsen   222409
104633        Maurice Ripke   231003
104634       Julian Guevara   231003
104635       Robert Stewart   231003

[100414 rows x 2 columns]

In [170]:
df_acteur = pd.DataFrame(columns=['acteur','nombre'])

for i in films_acteurs_sans_doublons['primaryName'].items():
    # print(i[1])
    # print(i[1])
    acteur = i[1]
    if acteur not in df_acteur['acteur'].values:
    # Ajouter une nouvelle ligne
        new_row = pd.DataFrame({'acteur': [acteur], 'nombre': [1]})
        df_acteur = pd.concat([df_acteur, new_row], ignore_index=True)
    else:
     # Incrémenter le compteur
        idx = df_acteur[df_acteur['acteur'] == acteur].index
        df_acteur.loc[idx, 'nombre'] += 1
df_acteur

                    acteur nombre
0                    Björk      1
1        Catherine Deneuve     35
2              David Morse      6
3           Peter Stormare     19
4                Joel Grey      1
...                    ...    ...
54079          Megan Drury      1
54080      Nicholas Baldas      1
54081  Stephanie Bendixsen      1
54082       Julian Guevara      1
54083       Robert Stewart      1

[54084 rows x 2 columns]

on exporte le tableau

In [171]:
df_acteur.to_csv('./donnees/stat/acteur_nombre_films.csv', sep="\t", index = False)

## nombre de films par genre et par acteur

In [172]:
import ast

def transfo_liste(x):
  if isinstance(x, str):
    return ast.literal_eval(x)
  else:
    return x

In [173]:
films_acteurs_genres_sans_doublons = films_acteurs[['primaryName','genres','id_tmdb']].drop_duplicates()
films_acteurs_genres_sans_doublons

,primaryName,genres,id_tmdb
0,Björk,"['Drama', 'Crime']",16
1,Catherine Deneuve,"['Drama', 'Crime']",16
2,David Morse,"['Drama', 'Crime']",16
3,Peter Stormare,"['Drama', 'Crime']",16
4,Joel Grey,"['Drama', 'Crime']",16
...,...,...,...
104631,Nicholas Baldas,['Action'],222409
104632,Stephanie Bendixsen,['Action'],222409
104633,Maurice Ripke,"['Thriller', 'Horror', 'Action', 'Adventure', ...",231003
104634,Julian Guevara,"['Thriller', 'Horror', 'Action', 'Adventure', ...",231003
104635,Robert Stewart,"['Thriller', 'Horror', 'Action', 'Adventure', ...",231003

In [174]:
films_acteurs_genres_sans_doublons['genre_liste'] = films_acteurs_genres_sans_doublons['genres'].apply(transfo_liste)
films_acteurs_genres_sans_doublons

,primaryName,genres,id_tmdb,genre_liste
0,Björk,"['Drama', 'Crime']",16,"[Drama, Crime]"
1,Catherine Deneuve,"['Drama', 'Crime']",16,"[Drama, Crime]"
2,David Morse,"['Drama', 'Crime']",16,"[Drama, Crime]"
3,Peter Stormare,"['Drama', 'Crime']",16,"[Drama, Crime]"
4,Joel Grey,"['Drama', 'Crime']",16,"[Drama, Crime]"
...,...,...,...,...
104631,Nicholas Baldas,['Action'],222409,[Action]
104632,Stephanie Bendixsen,['Action'],222409,[Action]
104633,Maurice Ripke,"['Thriller', 'Horror', 'Action', 'Adventure', ...",231003,"[Thriller, Horror, Action, Adventure, Drama]"
104634,Julian Guevara,"['Thriller', 'Horror', 'Action', 'Adventure', ...",231003,"[Thriller, Horror, Action, Adventure, Drama]"
104635,Robert Stewart,"['Thriller', 'Horror', 'Action', 'Adventure', ...",231003,"[Thriller, Horror, Action, Adventure, Drama]"

Afin d'optimiser le code nous utilisons defaultdict du module collections

defaultdict est une sous-classe du dictionnaire Python, provenant du module collections. Il est conçu pour fournir une valeur par défaut pour les clés qui n'existent pas encore dans le dictionnaire. Cela évite d'avoir à vérifier explicitement si une clé est présente avant de l'initialiser.
En spécifiant int comme argument lors de la création de defaultdict, chaque nouvelle clé accède automatiquement à une valeur par défaut de int(), qui est 0.

In [176]:
from collections import defaultdict
import pandas as pd

# Initialisation d'une structure pour stocker temporairement les résultats
temp_data = defaultdict(int)  # Utilisez un seul defaultdict(int)

# Parcourir les données
for i in films_acteurs_genres_sans_doublons.index:
    acteurs = films_acteurs_genres_sans_doublons.loc[i, 'primaryName']
    genres = films_acteurs_genres_sans_doublons.loc[i, 'genre_liste']
    # print(acteurs)
    # print(genres)
    # print(type(genres))
    for genre in genres:
        # print(genre)
        temp_data[(acteurs, genre)] += 1  # Incrémenter directement avec le tuple comme clé

# Construire la DataFrame à partir de la structure temporaire
rows = [{'acteur': acteurs, 'genre': genre, 'Nombre': count} 
        for (acteurs, genre), count in temp_data.items()]
df_acteur_genre = pd.DataFrame(rows)

In [177]:
df_acteur_genre

                   acteur      genre  Nombre
0                   Björk      Drama       1
1                   Björk      Crime       1
2       Catherine Deneuve      Drama      25
3       Catherine Deneuve      Crime       1
4             David Morse      Drama       2
...                   ...        ...     ...
167969     Robert Stewart   Thriller       1
167970     Robert Stewart     Horror       1
167971     Robert Stewart     Action       1
167972     Robert Stewart  Adventure       1
167973     Robert Stewart      Drama       1

[167974 rows x 3 columns]

On export le DataFrame

In [178]:
df_acteur_genre.to_csv('./donnees/stat/df_acteur_genre.csv', sep="\t")

## Création d'un dataFrame avec la liste des films par acteur

In [179]:
print(films_acteurs['primaryName'].apply(type).value_counts())

primaryName
<class 'str'>    104636
Name: count, dtype: int64

In [180]:
print(films_acteurs['id_tmdb'].apply(type).value_counts())

id_tmdb
<class 'int'>    104636
Name: count, dtype: int64

In [181]:
df_acteurs_liste_films = (
    films_acteurs.groupby('primaryName')['id_tmdb']
    .agg(set)
    .reset_index()
    .rename(columns={'primaryName': 'acteur', 'id_tmdb': 'liste_films'})
)

In [182]:
df_acteurs_liste_films

,acteur,liste_films
0,'Ganja' Karuppu,"{69509, 69638, 76965, 69546, 76974, 76850, 373..."
1,'Nandha' Saravanan,{69539}
2,'Poo' Ram,"{873696, 680652, 595228}"
3,'Punnagai Poo' Geetha,{63666}
4,'University' Jeevan,{330629}
...,...,...
54079,Üllar Saaremäe,{69219}
54080,Ünal Silver,{677053}
54081,Þorsteinn Gunnar Bjarnason,{575559}
54082,Þröstur Leó Gunnarsson,"{63907, 10989}"
54083,Þrúður Vilhjálmsdóttir,{10989}

In [183]:
df_acteurs_liste_films.to_csv('./donnees/stat/df_acteurs_liste_films.csv', sep="\t")